
#######################################################################
#
#	Gremlin-Python
#	http://tinkerpop.apache.org/docs/current/reference/#gremlin-python
#
#######################################################################

pip install gremlinpython
g = traversal().withRemote(DriverRemoteConnection('ws://localhost:8182/gremlin','g'))

from gremlin_python import statics
from gremlin_python.process.anonymous_traversal import traversal
from gremlin_python.process.graph_traversal import __
from gremlin_python.process.strategies import *
from gremlin_python.driver.driver_remote_connection import DriverRemoteConnection
from gremlin_python.process.traversal import T
from gremlin_python.process.traversal import Order
from gremlin_python.process.traversal import Cardinality
from gremlin_python.process.traversal import Column
from gremlin_python.process.traversal import Direction
from gremlin_python.process.traversal import Operator
from gremlin_python.process.traversal import P
from gremlin_python.process.traversal import Pop
from gremlin_python.process.traversal import Scope
from gremlin_python.process.traversal import Barrier
from gremlin_python.process.traversal import Bindings
from gremlin_python.process.traversal import WithOptions

>>> g.V().hasLabel('person').has('age',P.gt(30)).order().by('age',Order.desc).toList()
[v[6], v[4]]

statics.load_statics(globals())
g.V().hasLabel('person').has('age',gt(30)).order().by('age',desc).toList()
[v[6], v[4]]
g.V().repeat(out()).times(2).name.fold().toList()
[[ripple, lop]]





#####################################################
#
#	Graph Drawing and Network Visualization: 23rd International Symposium, GD
#	Graphs (emil)<-[:KNOWS]-(jim)-[:KNOWS]->(johan)-[:KNOWS]->(emil)
#	LIKES, IS_FRIENDS_WITH, and WORKS_FOR
#
#####################################################

https://github.com/andrewiggins/Facebook-Friend-Graph
https://gist.github.com/kateto/11092938
https://graph-tool.skewed.de/static/doc/quickstart.html
https://graph-tool.skewed.de/static/doc/graph_tool.html
https://graph-tool.skewed.de/static/doc/demos/inference/inference.html
https://graph-tool.skewed.de/static/doc/search_module.html
https://graph-tool.skewed.de/static/doc/inference.html
https://medium.com/intuitionmachine/teasing-out-tensorflow-graph-mess-64cf5ece4b00
https://graphviz.gitlab.io/_pages/doc/info/command.html
https://neo4j.com/developer/guide-data-visualization/
https://github.com/Unity-Technologies/graph-visualizer
https://de.slideshare.net/mongodb/webinar-working-with-graph-data-in-mongodb
https://en.wikipedia.org/wiki/Nested_set_model#Example
https://pear.php.net/package/Image_GraphViz/
https://graphql.org/learn/queries/
https://towardsdatascience.com/how-to-use-facebook-graph-api-and-extract-data-using-python-1839e19d6999
https://rdflib.readthedocs.io/en/4.2.0/utilities.html
https://igraph.org/python/doc/tutorial/tutorial.html
https://py2neo.org/2.0/cypher.html
https://neo4j.com/blog/why-database-query-language-matters/
https://neo4j.com/developer/cypher-query-language/
https://medium.com/labcodes/graph-databases-talking-about-your-data-relationships-with-python-b438c689dc89
https://www.forbes.com/sites/danwoods/2018/04/30/improve-your-graph-iq-what-are-graph-queries-graph-algorithms-and-graph-analytics/#d6b069719611
https://dzone.com/articles/graphs-in-ravendb-the-query-language
http://pauldone.blogspot.com/2018/04/mongodb-graph-data-intensive-book.html
https://www.compose.com/articles/graph-data-with-mongodb/
https://github.com/mongodb-labs/socialite/blob/master/docs/graph.md
https://neo4j.com/docs/cypher-manual/current/clauses/delete/
https://orientdb.com/docs/last/Tutorial-Working-with-graphs.html
http://www.sarahmei.com/blog/2013/11/11/why-you-should-never-use-mongodb/comment-page-1/
https://www.novatec-gmbh.de/en/blog/nosql-or-why-i-chose-mongodb/
---------------------------------------------
mongo Gremlin
---------------------------------------------
http://tinkerpop.apache.org/
https://docs.janusgraph.org/latest/gremlin.html
https://github.com/tinkerpop/gremlin/wiki
http://tinkerpop.apache.org/docs/current/recipes/
https://docs.datastax.com/en/dse/5.1/dse-dev/datastax_enterprise/graph/using/startGremlin.html

g.V().has("name","gremlin").      out("knows").out("knows").values("name")
gremlin> g.V().has('name', 'hercules').out('father').out('father').values('name')
gremlin> g.V().has('name', 'hercules').out('father').out('father').values('name')

https://github.com/okram/mongodb-gremlin
https://www.datastax.com/dev/blog/the-von-gremlin-architecture

gremlin> g = graph.traversal()
==>graphtraversalsource[tinkergraph[vertices:4 edges:3], standard]
gremlin> g.V().has('name','Gremlin').out('languages').has('name','Ogre').values('language')
==>Clojure

https://de.slideshare.net/calebwjones/intro-to-graph-databases-using-tinkerpops-titandb-and-gremlin

